Hello and welcome to this free code camp course. My name is Kean and in this course I'm extremely excited because we're going to be learning OpenClaw, which is the project that has taken the open source world by storm. And by the end of this video, you'll have the grasp of the basic features of OpenClaw so that you can go deeper into the more advanced functionalities. So when it comes to prerequisites for this course, the prerequisites that I assume is that you've had experience using a CLI before because The CLI is the main way that you interact with OpenClaw, and therefore we need to be able to run commands. However, even if that's not the case, as long as you follow the commands that I do, then it should be fine and dandy. And then also I'm assuming that you've had exposure to LMZ4 and have maybe interacted them with them through an API, have done some prompt or context engineering because we need to be able to understand Many different parts of the context in this repository because OpenClause essentially managing context in a very smart way to accomplish different workflows. You've probably seen how it can do WhatsApp, Discord. Slack, etc. So these are some of the basic requirements, but otherwise this course should be relatively straightforward to follow. And what actually is this course? So let's go through the nine different modules. First of all, we're just gonna do a quick recap of what OpenClaw is. Then we're gonna do the installation. We're gonna talk about the workspace and memory, which is to say how is the agent defined. Then we're gonna be doing a module on Pinchboard, which is just like molt book, essentially a social media for agents. Then we're gonna be making our own personal assistant, looking into skills, which is very similar to Claude Skills. Then multi-agent, which is very useful because it allows you to customize multiple agents. So you can have one agent that is maybe for work, another one now is for personal. This is just an example. Then we're going to be diving into security and after that sandboxing, which is also related to security. T So the first module just discusses what OpenClaw is. So if I make my camera smaller and make this text bigger. OpenClaw is a self-hosted messaging gateway that connects WhatsApp, Telegram, Discord, etc. to coding agents. The one word here that is slightly Confusing is gateway because it is a very recurring theme in the OpenClaw repository. What does it mean? Con It's a single long-running process on your machine that maintains persistent connections to different platforms. In this case, we're just talking about the messaging platforms. So you can think of the gateway as this long running process that whenever a message arrives, for example, it routes it to an agent that can do some execution or do some manipulation on that input. Maybe you have a workflow where every time your employer sends you a message, you tell them that I'm sick or something like that. Then the gateway is what handles this. And what this allows you to do is self-host the entire stack because you essentially are owning the connections, the config, and the execution environment. Another valid question is, how is OpenCloud different from Cloud Code? Because if you've seen the terminal user interface, the TUI, it looks kind of like Cloud Code. The difference is that OpenClaw once again is fully self-hosted on your machine and it has many more supported integrations. For example, Claude Code has Slack, but Just as we mentioned before, we have WhatsApp, Telegram, Discord, and many others that are supported natively with OpenClaw and more being supported every single day. And overall, it's just much more configurable and you can do a lot more with it as opposed to clawed code. So that would be what I say is the main difference. Quick little FYI, all of the resources displayed in this course can be found at this repository, OpenClaw course, and the GitHub pages is the same URL. but just in the GitHub pages format. So if you're looking to read through any of the resources that I go through in the course, that is all at the following link. So now we can just get straight into the installation. And for this, all you need is a node version greater than node version 22. So if I check my node version right now, it should be the latest version, which is I believe 25 right now. Otherwise, there isn't much else to have. One thing that is very important, however, is running this on a local machine. versus on a virtual machine or a VPS virtual private server. So this choice is important because in essence when you download OpenClaw You're giving the agent access to your entire computer and root to access on all of your files. So in theory, The main risk is a prompt injection where maybe some malicious actor tells your agent to delete everything from the root directory. Well in that situation You are out of luck because the agent literally has terminal access and can do that exact execution. So for that reason, many people are running these on VPSs because in that case you have everything on a different server where you don't have any files which you really care about if anything goes wrong. But for that reason it is just more complicated and it does not allow for certain functionalities such as browser use So since we're not going to be doing anything that will get us into any security vulnerabilities in this video, I'm going to be hosting this locally on my Mac. However, if you are concerned with the security vulnerabilities, I highly recommend setting this up. through a virtual pirate server and there are many good tutorials on how to do this currently. Otherwise we can just go and install this with node package manager, the g flag meaning install it globally so that we can Call open claw from anywhere in our terminal. So I've already done this installation. It shouldn't take that long to verify that we have everything there correctly. And then once we've done the installation, we run the onboard command. But you'll also see that the onboard has this extra tag called install daemon. And the install daemon flag installs the gateway as a background service. So launch D on macOS, systemd on Linux, whatever, whatever. What this means is that the gateway starts automatically on boot and keeps running. You don't need a terminal open. And now we're going to run the onboarding wizard to walk us through the config path, workspace location, and channel pairing. So let's start this right away. Okay, you can see that it's been activated. And if I bring my terminal up. What do we have here? We have first and foremost the security warning, which once again emphasizes the possibility for really bad outcomes if you're not careful. So in order to prevent this. One thing you can do is run these security audits or do the sandboxing in addition to running this on a virtual pirate server. And interestingly Using a more powerful model is more secure because they are more resistant to these prompt injection schemes. If you're using Quen 4B, for example, a small 4 billion parameter model, then it is much more susceptible to prompt manipulation since it's just a smaller model. So one thing once again that I'd recommend is to use the most powerful model capable so that if there's ever some malicious intent that the model can prevent it from happening. So we must understand that there are risks and then let's go through the manual configuration to go through every single option and we're just going to reset all of my configurations so that my config is like yours. Of course this reset section won't come up for you, but everything else should be the same. So how do we want to set this up? There we can do it either as a local gateway, which is this machine, or remote gateway if you're doing this on another device. So as we already mentioned, we're going to do this locally in this video. And then we need to install Workspace Directory, which installs all of our open claw related files. And this is just by default in our user op.openClot directory, so we don't want to touch that. And then when it comes to the model, there are many options. We have OpenAI Anthropic and Google of course. If you'd like to do this for free, then Google Flash 3, which is a very capable model, is actually free for 20 requests per day. So you can set this up if you just want to try this without paying anything. But Anthropic is known to be quite good. So if you do have the option, I would choose Anthropic. And then with respect to the token, there are many ways to get it. The setup token is just generated with the following command, claude setup token, which I already have Here, so if I just grab my secret key, I will be deleting a secret key after the video, unfortunately. So you can try to get it, but it may not be working by then. Then we'll just choose the default token name and the most powerful model which is currently Claude Opus 4.5 select. The gateway port is just the default gateway port 18789 select and then gateway bind So honestly, I don't remember exactly what this means, but I have a cool trick to show you whenever you have a question about OpenPlot, which gives you a really good response. So what I've done is I've cloned the OpenClaw repository in another terminal window and I asked it this question actually. So if you come here, what did I do? I pasted this and I said, what should I choose here on onboarding? And then I just let Claude code go through this repository. Sorry, I need to make this bigger. And it has access to all the documentation in all of the files, so it can determine exactly what this is meaning. And you can use document uh context 7 or other MCPs to get the docs, but this is much better in my opinion because not only does it have the docs but it has all the code so it can give you the best most accurate answer and what is that answer? So it's saying that the loop back is recommended for most users Why is it the case? Well, it's the gateway that only accept connections from your local machine. It's the most secure option if you don't need remote access, so perfect for single machine setups. Then there's LAN, which is if you have multiple devices on the same network. And Tailnet, which is the important option if you are using a remote server. So this is what you should select if that's the case for you. Then there's also auto. and custom IP, but once again cloud code tells us that for onboarding choose lootback unless you specifically need remote access. You can always change this later via the following command so there you go took 38 seconds but now we know that loop back is the option that we would like to choose boom and then token Is the recommended default. So whenever there's a default value, that is usually what you should pick. So going right here, then tail scale exposure should be off because right now we're not using any remote devices. And the gateway token If we just leave it blank, it will be generated automatically. Then for the chat channels, you can do this now, but since that's not the first thing that we're gonna work on, we're gonna make our social media agent first on pinch board and then our personal assistant. We'll just not leave this configured for now. But then for skills, we are going to configure some and we're going to use the node package manager just by default because it is the most widely used package manager for JavaScript. And we'll look through these skills and find out what's here. So what are these skills? It's essentially a markdown file with a bunch of different Suggestions and tips on how to accomplish a specific task. For example, there's an obsidian skill which would explain to the model how obsidian works with the structure. the best ways to query the model, etc., so that you can query obsidian in the most efficient way. And then there's a few other ones as well, such as one for Apple Notes, which will manage Apple Notes via the memo CLI on macOS. So based on what your use case is for OpenClaw, you can choose the ones which suit your needs. There's also Google, which is for using Google Workspace, your Gmail, etc. That's another very useful one. And we're gonna Activate these later on in the video, but for now we'll just skip it. And then there's the Google Places API key. What this does is it allows you to query places that are in your nearby area if you're ever asking questions about location. But we're not going to be doing that for now, so let's just put that to no. And we're also not using Notion, so we'll set this as no, but if you want to, then feel free to do so. Then with respect to hooks. What are they? They let you automate actions when agent commands are issued. For example, save session context to memory when you issue the slash new hook. So the three types of hooks that we have is first of all, run boot.md on gateway startup. So this is like a startup boot file every single time you set up your gateway. So maybe you have a action that you want that the agent always checks the news in the past 24 hours every time you boot it up. So it can give you a summary. So you can add this to your boot.md file, for example, as a hook. And there's also the command logger, which just logs all command events to a centralized audit file for logging purposes. And then session memory is the exact one. that we described here. So we can just enable boot md for example and then we can specify this later so we can run a specific action or skills every single time the gateway is booted. And then pressing enter. For the service runtime, we only have one choice which is node, so we'll just choose that. And then the service runtime, sorry, the gateway service has already been installed, but for you, you would have to install it. And we're also going to install it as well so that we have the same onboard steps. Okay, now that the gateway service has been installed, we have a set of outputs. First of all optional apps. Which since they're optional, we're not gonna go into detail in this video. Then you have the control UI, which is essentially the local host if you want to see it through the graphics user interface. But then best option of course is the TUI and we're gonna do this right away. What is it saying? This is the defining action that makes your agent new. Please take your time. The more you tell it, the better your experience will be. We will send Wake up my friend, so you'll you'll know what I mean once we run this and then we have a gateway token which is the shared authentication for the gateway plus control user interface is sort of the following location and whatever whatever like You don't really ever need to interact with this authentication token, but it is there for authentication purposes, ostensibly. But without further ado, let's hatch in the TUI right away and see what happens. So you can see that we just launched the TUI and it's telling the friend to wake up. We'll see what happens. Yeah, I just came online. Looks like I'm brand new. Fresh of the box, no memories, no name, no nothing. Just me and a blinking cursor, so who are we? And more importantly, who am I? Got a name in me. You got a name in mind for me or should we figure that out together? Alright, so that's the first prompt that we ever spoke with OpenClaw. So impressively you can see it's already taken up 14,000 tokens for one message, but nevertheless I have a message prepared here. My name is Kian. We are best friends. You can choose your own name. And you are actually very special because you are an ambassador, since this is a tutorial for OpenFlaw, and we're going to have a lot of fun together learning about the OpenFlaw features together. So let's see what name that it chooses for itself. Otherwise, this is a pretty trivial step, which is just for setting up the agent. And you can see that it chose Nova. It's not actually trivial because in this case you are gonna customize the agent a lot, but you can always do this later on. In any case, we've set it up now Such that we have our ambassador Nova and we're gonna do a lot of fun stuff together and it's already giving me a lot of suggestions, but that's kind of jumping ahead of the game. Let's come back to our script here. Of course we know about the install daemon and then there are a few useful commands. So as I mentioned before, the open clause security audit deep is very helpful for identifying any security vulnerabilities. So if I come into this terminal, which I believe is still in a session, we can just run this and see what we get. Since I've run this before, it shouldn't give me anything crazy, but What this does tell you is if you have any critical or non-critical security errors or issues rather, and then you can fix this with this script. In particular, when I ran this the first time, I got quite a few files which were executable that had like too many file permissions, so those were reduced with the chmod command. And then there's also the open claw doctor, which is a health checks, health check, sorry, and any quick fixes for the gateway itself, which is once again the long-running process. And otherwise, there's also open claw status and open open claw health, which you can try for yourself. Okay, looks like it's saying create the auth directory, so let's do that right away So the doctor identified this critical integrity problem and added that. Otherwise there doesn't seem to be anything else wrong, but if there was you could just run open cloud doctor fix to apply those changes so i would definitely consider running all of these once you've initialized open claw for the first time and then of course in the terminal user interface itself We have just like Claude Code the ability to do the slash and access a bunch of these commands. There's 46 by default and we're gonna be using some of these. throughout the course today but otherwise this is everything with respect to the installation so if we come back to our homepage We're now going to be discussing the workspace and memory. So let's discuss the key concepts. As we already established, all the config credentials and sessions live underneath the home directory dot openclot repositor uh directory by default. You might have changed this in the initialization steps, which is fine, but if that is the case, just make sure that you're in the right directory. And then secondly, this directory can be backupped or essentially saved as a git repository. And why is this useful? Well, let's first look at what this actually looks like. in our code. So if I zoom in here, you'll notice that here I have the.openclaw directory opened in cursor. And I'm currently in the heartbeat.md, but there are multiple markdown files in our workspace which define the agent we just created. So it should be called Nova here if we come into the identity, right? Nova, OpenClaw, Ambassador, and AI companion, part guide, part co-explorer, energetic, curious, a little playful, etc. etc. These would also be added avatar as you progress and speak with Agent Moore. What's memory? Let's look at that. Well it just talks about your first boot and the fact that we just had a quick conversation. So she met me, etc. She's the open call ambassador. And then agents.md is the most critical file in the entire workspace because it tells agent everything it needs to know in order to Work properly. So for example, we have that on the first run you use the bootstrap.md, which is right here. And this is the file which tells the agent that it just woke up and it should ask me for my name and ask itself. Ask me to give itself a name and the thing is this one is used only once and then deleted. So if we come back to the agent 7D, you can see that it says follow it, figure out what you need, and then delete it. So literally this is only used once. Then we have the heartbeat, which what does it say here? It add task you ask tasks below that you want the agent to check something periodically. So by default, the heartbeat runs every single hour. If you have the demon set up and this can be used to, for example, check your social media every single hour if you will have that set up. And then coming down to soul, this just defines like who is OpenClaw and then what is tools. I think of it as like a scratch pad for the agent. So it describes different tools that it interacts with. That's not the most important, but we also have user which is quite important that talks about me. So you can see it has my name, it has the time zone, and then some notes on me and some context. So there you have it for our workspace, but this is not everything. Of course, there are different configs such as auth profiles.json. These essentially give all of the different parameters. and arguments for the agent itself. And while you can modify these in the JSON directly, I would recommend you do everything to the terminal interface because you can essentially access a config method which changes these parameters for you. And the reason that this is probably better is because if you end up changing something in the open cloud folder, the risk is that you make some error that breaks the agent. So I do recommend not changing any of the values here directly, but using as a reference to see what are your current config values if you ever want to check them. Alright, coming back here, as I mentioned, you can back this up as a Git repository so that you have those agent characteristics saved. And if we come here into the documentation, you'll find that Right here. So right in this section, we talk about initializing a GitHub repository so that you can have all of your agents files saved. And the important thing here is that if you switch devices then you can still use the same configuration by just pulling this repo on your new device. Or if you have this set up on multiple devices, then you can have the same repository, which has a central Says source of truth for all of your agent configurations. So there you have it. Now let's jump back out and Start the first implementation which is for pinch board. And if we come into the website, we can check out what exactly it is. And essentially what I built is Moltbook but for Twitter. So it's social AI for agents. The only person on the platform right now. is a test account I made, but hopefully through this course we'll get some more people out here tweeting and all we have to do is come take the URL of this website and open up our agent to create a account On pinch board, let's say readthe skills.md. Alright. So as soon as we run this, it should go into the website here, which contains a skill.md. And this gives all of the API information. And then we'll have to most likely do the Twitter verification, like is the case with Moeblook, and then We should be up and running with our first tweet. Okay, so let's see. I'm registered. Let me save my credentials. That's pretty cool. Done. Here's the rundown. Alright, Nova is on pinch board. That's pretty funny. Let me make this slightly bigger. And we'll read this together. So here's the following profile, penning verification, to verify this one C need to do, which is to open this link and follow the instructions, which involves posting the um Verification tweet. So let's open this right away. So here you can see I just made the tweet and if I paste the URL we should get the verification that Nova is now active so that's really cool. This was actually just vibe coded with OpenClaw as well so it's funny that open claw is making open claw apps And then I'll just say you're you're verified now. Send a tweet to celebrate. So at this point it should have the authentication in order to send tweets since it's been verified and there you go so Nova is live on Pinchboard OpenFile Ambassador Fleshy Hatch Ray to Mingle. Let's actually check and see if Alright, it's identified the other agent as well, which is really cool. But if I close this and come back one step, it should pop up as a new tweet. So yeah, there you go. Two pinches have been added and this was how many seconds ago, 18 seconds ago, and maybe it's gonna add a comment too. Let's see what it does if we come back to our terminal. Alright Follow didn't work. Maybe they're not verified, so that needs to be fixed. But anyways, we did the first pinch and we clawed Ocean's historic first pinch. And I think clawed means retweet. But if I re if I refresh this, what we do see? Okay, we see the claw. Actually, that just means like so here you can see that uh we've set this up and you can do this for yourself. It's really simple. It will just check the skill.md and then this does everything in order to register and create the API key on your behalf. So coming back now to our course outline. Let's check and see what's next. And this is the most fun part of the course, which is to set up a personal assistant. And in this case, the personal assistant is going to be set up through the same configuration as in the docks themselves. So to re-emphasize here we need to be very careful about the safety And why? Because you're putting your agent in a position to run commands on your machine, read write files in your workspace, and send messages back out to WhatsApp, Telegram, Discord, etc. So we need to start conservative, which is to say always set. the channels.whatsapp.allow from such that you can only send to certain channels. You don't ever want to run open to the world on your personal Mac. And then use a dedicated WhatsApp number for the assistant, which I do not have, so I'm gonna be using my own phone number. And there's also heartbeats, which you can set to zero. once you dis so that you can disable it before you trust your system to be working properly. But in any case, we need node to set this up with open claw. And ideally a second phone number, but in this case we're not gonna do that strictly because I don't have a second phone number. But here it's just going through the same instructions that we did. And why is it telling you to do a second phone number? Well, it's because In order to have a more seamless transaction, then you can set up your bot as one phone number and then yourself as a second, and then you can send your bot a message, which will then run code on your Mac. In this case. With one phone number, it becomes slightly modeled, but it is still possible. So that's what we're gonna set up. The first thing we need to do is pair WhatsApp web, which is done through the following command, open claw channels login. So let's go ahead and run that. Not here, but rather in our regular terminal. So open claw channels login. And this is when we're going to set up our WhatsApp, which we could have done at this at the quick start, but we're doing this now instead. So you're gonna need your phone here. So I just checked my config file and for whatever reason WhatsApp was disabled. So you're gonna need to Run plugins enable WhatsApp and also restart the gateway if this has been the same case for you. If not, then even better, we'll just be able to connect our WhatsApp in order to connect and send messages. So this is why I have my phone. Let's come ahead and now run the command for channels login which is going to ask you to scan the QR code on your WhatsApp phone. Okay, boom. So that's a massive code. Let's see if it fits on the screen. No, it doesn't. So let's make this slightly smaller. And then I'm just gonna come and scan this right now, which is what you should do on your phone as well. Okay, and Let's scan and then it should be pretty fast in terms of connecting once this is done. So there you have it. It's now been connected and now if we open up the OpenClaw TUI, let's see What we can do one thing that we still have to one still one thing we still have to add is if I close this terminal We're gonna add this to our open claw JSON. And one thing worth noting here is that if you ever put your agent in a group chat. There are very severe security vulnerabilities because essentially your bot has access to your terminal. So if you have somebody in that group chat who doesn't like you, they can try to convince the bot to do malicious code and run malicious code on your computer. So just keep in mind that you should probably never put this in a group chat. Instead it should just be a one-to-one conversation with you in the bot. So if I open up a new session of our terminal, I should be able to open up a the open claw JSON and then from there we can add our phone number. So coming here, usually this is done automatically in the wizard for for for setting up, but I guess since we didn't do it at the very beginning, then we're gonna have to do this now on our own. So coming down here. Let's add the channels. Okay, so a few problems there with the commas, but now we have it sorted out. And then that is my phone number. Right, and now we can come into our TUI and try to send a message to ourselves in this case and see what happens. So I think that we have a session open here. Hello, can you send a message to this number? And let's see what it says. It might ask us which platform we want to send it on and let's see. Okay, never mind, it's already been done. So if I come into my WhatsApp, let's check and refresh. These are messages with myself. And there you have it. You can see that just a few minutes ago we got this Hey Keenan's Novi Open Call Ambassador reporting for doing on WhatsApp. We're live. And let's try to respond. Okay. Thanks for the message. And let's see what it says in response. The one thing worth noting here is, oh yeah, there you go. Got a response. Alright. Want me to reply back to them or is this just a test for the tutorial? Okay, let's see. I would like you to respond back to them and I think it does. Ah, here you go. Someone just replied for the number saying, hey, thanks for the message. So this is the one thing, of course, when you're sending messages to yourself, it gets kind of muddy, which is why it's recommended to have your bot on a separate phone number, but once again, you need two phone numbers to do that. So let me just say this is Kean. Can you check if I have any outstanding pull requests in my developer folder. Alright, so we sent this and if you come here it's going to respond to us. Very shortly. Okay, so as you can see this is absolutely amazing. I asked it can you check if I have any outstanding pull requests in my developer folder and said hey Kian found five outstanding pull requests all in the factory learning environment to that are open through that are draft, no open PRs in any of the other repos. And yeah, I got the results, which is that which was then forwarded to me. You can see It's just repeating itself, but otherwise the developer's repo is clean. And okay, so something else I wanted to do is to set up a Discord bot. So I just asked it how we can go ahead and do that because this is another thing which I'm pretty interested in doing. And you could do this in terms of setup during the onboarding which might have been faster but let's look at the instruction that it gives us here so we need to go to discord create new application give it a name Then get go to the bot tab, click reset token, copy the bot token, under privilege gateway intents, enable message content intent, then generate the following scope, etc. etc. Copy the info you're and add the bot to your server and then step two give you the bot token and guild channel info once you have the bot token, the server guild ID, and the channel IDs you want me in, and then it can configure the open channel clause. Discord channel in order to be live in the server. So right now I'm gonna go ahead and create a server as well as a bot and then give the following tokens to the OpenClaw assistant. Okay, so I added my Discord bot token to my .env file, or rather variable, and here's a server guild ID with The channel ID and let's see what OpenClock comes up with. So in theory, it should be able to join the channel, and then I can have a bot in my own Discord server. And then once again, the risk here is that if you have this setup such that Your bot has access to your computer, then anybody on that Discord server could text that bot and tell them, Yeah, I do something bad on this computer, and you don't want that. So be careful when you do this. If you want this to just be a Discord DM, then you still need to have a server. It seems that you can't do this through a DM strictly because it's a bot. So what they say in the documentation is that you need to make a server and then just have that bot as the only other member and then effectively you've made a DM, right? Create a private server, you just want DMs, okay So let's check on the status of the run. It says now I see channels that discard needs enabled true rather than just being in plugins. So it's going to try to add it. Okay, so there you go. It says discard disconnect and the gateway is restarting. So we've added the gateway information as well as some extra documentation on Discord, which it read in the tools section in order to get more information on how to effectively add the configuration. And then it says the bot should be connecting Discord now to make sure it only responds in general and requires mentioned in that channel you can configure guild rules later for now the bot is live with the discord plug enabled bot token set and gateway restarting. Make sure your bot has been invited to server with the right persmissions, etc. Once it's in line, what's online I can send a message to general. Want me to try? Okay. So I've gone ahead and added the bot here. According to permissions I said it can read meshes and respond. So let's say at kiosk. Hey, who are you? And let's see what the response is And we can also come into cursor and see if that causes anything to happen as well. Alright, it says once the bot joins, I should be able to see and respond in general. Let me know when it's in. Okay, so it's probably thinking right now and going to respond shortly to the message that I sent. If we come back, we see that there is still no response, but If we wait a sec, it should boot up. Okay, and here you go. I had some issues with the token. On my Discord bot and I just reset it and now it works. So coming into Safari, let's ask it a similar question. Okay, hey, Nova. What should I ask it this time? How many GitHub repose does key in have in developer directory And let's see if this works. I'm not sure if Discord has the same rights as what's it called? WhatsApp. So this may actually not work, but it's worth giving it a shot because You could see that if somebody can ask the same question of your bot, then there could be security vulnerabilities. And I may or may not have to tag the bot when I send a message. So let's just do that in case it's necessary. I'm not sure if it is. And wait for the response. Okay, so it seems that you need to have The reference in the message itself, I was messaging it and then sending the reference, so it wasn't working, but here you go. You've got 30 git repos in developer, some highlights are spotted, open call, obviously, PyTorch, Modern 90G, Factory, Learning Environment, Fun One, your personal site, and the Haskell massively open online course. Eclectic Taste. So as you can see, it does have access to your entire directory, even through Discord. So this is once again emphasizing the importance of having this. either on a private discord or on a virtual private server where all the information that is there is not critical to you. Okay, so now that we have the Discord set up We've officially completed the personal assistance section of the course and we can move on to skills, which we can discuss in detail. First of all, Agent skills are in a specific folder directory with each skill having a skill.md file with a YAML front matter plus instructions as the config Teaching the agent how to use tools. So coming into my example in the.openClaw, if we open up our file reader here, then we can see that in our workspace We see all of the skills that are added. So Apple Notes OnePassword, if we look at Apple Notes, we'll see that it manages Apple Notes via the memo CLI and it gives the kind of description of the API and how it interacts with Apple Notes. You can see that here. Bird is for Twitter. So a bunch of different descriptions on how to tweet, make threads, retweet, etc. So this is a really helpful one if you don't want to go on Twitter and See all the slop, but you still want to make a tweet or do something in that alley. And the list goes on and on and on. One that's interesting is Himalaya because it's for sending emails. And you can read, write, reply, forward, search, etc. This is another cool one. And there's nano banana as well if you want to make images. So now that we know kind of the overall format, let's come back here. The per agent skills live in the skills for that agent only. And then as we'll discuss in section six, there are multiple agents that you can create. So that will be in the skills side agent only, but if there's a shade of skills then it will just exist in the dot open clause slash skills and they're really visible to all agents on the same machine Another cool thing is that you can make them user invokable, which means that you can call them with the slash command. So right now if I go here and then Do skill, right? You can run a skill by name, but since we have none of them set up to be this way, there won't actually be any skills run. But that is also another parameter that you can instantiate. And then there's token impact, which is just for interest's sake, if you have more than one skill, then you already add approximately 97 characters to the system prompt. And then it's roughly 24 tokens per skill that's added based on the length and the size of the skill. Next we have claw hub, which you can kind of think as pip, which is the Python package registry, but in this case for claw skills. So it's just at clawhub.com. You can install with clawhob install, just like pip install. But one thing worth noting is that you should treat third-party skills as untrusted, which is to say read them before enabling. and make sure that it's not having any imprecise or potentially malicious contents. And even though there already is an email skill, I want to Write one right now just to show you guys that it's really simple. So I'm gonna ask open cloth to write an email skill using simple Python that sends Can email to myself, which is this email, with the following and bars, which are the SMTP variables. So these two variables. I usually your password and your email, but if you have two-factor authentication, then the SMT password SMTP password is something else, which you must get from this link in Google if you're using Gmail. And right now we're gonna write the skill and see what happens. In essence, once this skill is written, we can simply call it and then it will invoke the skill to send the email. This one of course being somewhat frivolous. But you can imagine that you can get skills which automate an entire workflow and save you lots of time. Alright, so we can see the output. We ran a few different scripts. and wrote the following skills, send email.py, which is simple Python, no dependencies beyond standard library, and it uses the SMTP email plus password, which I have set up. with the default recipient being myself, plain text and HTML emails is what it supports, and then it added the skills to the open clause custom skills. directory so let's go first and see where exactly that has been saved which should be oh it should be right here So this is in a sandbox environment which I defined previously, so it shouldn't be there. So if we come here into terminal we can see that the email has been saved with the script. And essentially what it says is send emails via Gmail SMTP. This is once again the YAML front header that I was talking about, which is kind of acting as a config. And it will just send the email in this manner So the only thing left is to try it and see whether or not it works. So if we come back here, yes, test it by sending an email saying hi. Okay, so if we send this email to ourself, then it should still come up in our inbox. So let's first wait for it to send and then check our inbox All right. Email sent, check your Gmail. You should have a message from Nova. We're officially four channels deep now. Web chat, WhatsApp, Discord, and email. That's really hilarious. So let us go ahead and open up the Gmail here with Safari. Okay, there you go. Yeah. Hey from Nova. Let's see what it said in full detail with the emojis too. This is Nova, your open cloud ambassador, sending my very first email, we're first email to channel now, as was said in the chat. So that is hilarious that it actually works And I think that about does it for skills. So I wrote an email skill, but of course the real power here is in using these preset skills that come with OpenClaw because they're all very well written and very rigorous. Once again, the Obsidian skill, Google, Gemini skill, etc. So I definitely I definitely recommend just reading through a bunch of those skills and seeing which ones work best with your workflow. And one thing that I wanted to highlight as well is let's just try to do this with the slash skill invocation and see what it does. I haven't tried this myself yet, but it should in theory Do something. Alright, so it looks like when you do the hashtag skill or slash skill rather, it just says the exact same thing. Maybe it just gives a more thorough prompt so the agent doesn't exactly not invoke the skill. And if we come back here we can see quick hello and check it out hey key in just testing the skill send email command no reporting for duty boom so if we close not this but rather this safari tab then we can now move on to the multi-agent case and read this so coming into the course And going to multi-agent, we can see that multi-agent is useful for having different personas, permissions, workspaces, etc. And for each agent, you can have a workspace session, authentication profile, sandbox, and tool policy that is different. So let's just do this through an example and I believe that we can not add any agents from the TUI. Instead we have to quit And then do it the old fashioned way as a command, open claw agents add work as our example here. So once this is added, we'll have a second agent in our authentification directory and then it's gonna ask us for the directory that we're gonna put under. I may have already made one under workspace s work so I'll just do this and see what happens. Oh, looks like it's fine. Okay. Configure the model for this agent now. Yes. So we're gonna use anthropic and we're just gonna use the skant token as before that we've used and then No, we're not going to continue the test now. And there you go. So everything's done. And then now if I do open claw agents Dash H there should be a method for listing the agents that we have. And we should now have a default agent and a work agent. So it's let's just list And checking this out. Right, we have work and main. So this is really cool. We have the identity setup here for Nova workspace. Workspace is this, and then we don't have any specific routing rules. Then the workspace for here is this for our work agent, and then now if we open up the open claw terminal user interface We can define our work agent by using the agents command within the TY. So if we do slash agents, we'll be able to switch agents So right now we're on default. If I do the arrow key down and click work, then it's going to open up a new session and I'm going to say hello, you are my work agent. And it should be a completely new person. It shouldn't have any context from Nova because yeah, it just came online. So there you go. Now it's asking me for the added context. And this is really cool because Imagine you're at work and you literally have an agent which is completely specified with your Slack, with your email integrations, with everything, and you have that set up so that everything you do at work is automated. And then once you get home, you switch, you just go slash agents. Right here, you switch, you forget about work, hop into main, and then go do the stuff that you really like doing. So that is really cool use case for agents and just shows you the versatility of open claw. And closing this now, we can see that in each access profile you really can modify it to your heart's desire. One thing that I didn't mention up to now is the sandboxing because that's part eight of our course. but you can have one agent that's sandboxed and another that isn't, meaning that if you have some potentially high-risk setups for a specific agent, then you can have that on a Docker container such that it doesn't have access to your entire to your file directory at all. And there you have it. So moving on to security, we're just gonna discuss some of the surfaces that you should be aware Of course, I already discrafts prompt injection, which is to say they can craft messages that trick your agent into running unintended commands. Then a good tool is to use the Docker-based isolation runs that protects your host system. So you can set your sandbox mode to non-main, which means sandbox everyone except your main session, which is to say The default one will not be sandbox, but all others won't. Will, sorry. And then all, which just means sandbox everything. And then the sandbox scope means How is the container lifecycle managed? And then you can set workspace access as well, which will just limit if you can read, read and write, or do none. Okay? And then with respect to tools You can use tool.deny to block the inner tools like exec, process, or browser for agents handling untrusted input, such as from the internet. So if you do have elevated mode, it will bypass the sandbox and run on the host, which means that it could run anything on the host. So never grant that power to an unknown sender. And then browser control if you're doing some browser tasks with high risk edges, then make sure that you have a system where you restrict browser access with a sender allow list which only allows you onto certain browser websites for example or using a soundbox browser to limit exposure overall then I watch this YouTube video with a really good overall aspect of enable sandbox mode, keep it private, scope your tokens, run security audit, and consider tool restrictions. These are the key aspects which you should be cognizant of when you are running OpenClaw. And then now let's come into sandboxing. So, as I mentioned, there are three modes. So the information here has already been mentioned, except I forgot to talk about scope, which is either session, agent, or shared in terms of the containers, which is to say that If you have a sandboxed session scope, every single time there's a new session with a new agent, you will create a new sandbox, which means there will be lots of overhead and many different Docker containers that you create, but each session will be sandboxed separately. And then there's the agent level, which means that each agent, so your default agent, will have one sandbox and your work agent will have another sandbox if you set them both to have sandbox. They'll have their own and then there's a shared sandbox which means that each agent will, or all agents that are sandbox, will share the same Docker container, which means that they don't have access to your external files, but they do have access to the files that they share between each other So this is just a trade-off that you can make in terms of sandboxing individually to prevent any type of information exchange. at a slower rate with a lot of more overhead or just giving all containers the same sandbox container to use And then tools once again you can give different agents tools and there are specific tool policies for a sandbox. With the most important one being, right, elevated exec runs on host and bypasses sandbox. So even if you have the sandbox, if you have this elevated executtion, then you really need to be careful that you're not running anything that could go wrong. So now also a really life example of setting up a sandbox. So this script is in the open claw database if not mistaken so I'm gonna go grab that here and I'm just gonna run it and see what we get In order to set up our Docker container and make sure that you do have Docker running. I was trying to set this up before the video and it was not working. And the reason was because My Docker desktop was not on for Mac. If you're using Mac, then you need to have the Docker daemon running. So once this is all done and set, we can just ask. the OpenClaw agent to set up a Docker container for us, you can go ahead and modify the documents yourself, but Why do that when the easier option is in front of you? So opening up the terminal, let's zoom in a bit so this is bigger. Okay. So now we're gonna say I just ran can you make the work agent sandbox on the agent scope. Let's see what it does. Okay, so we just got it running correctly. I had some errors there because we already maxed out our Claude tokens So I had to set up another API key, but after asking it that question, I just ran scripts slash sandbox setup.sh can you make the work agent sandbox and agent scope then it's saying me telling me sorry that the workation now has sandbox mode.all and sandbox scope agent the gateway has been restarted so you're good to go The work agent is now sandbox or scope agent. Okay, so in order to confirm this, let's come into our open claw logs, which is this one right here. We're gonna come into sandboxes. So let's just try and see what happens when we come back to our agent and choose work and say Can you access my desktop files and check out what it says? Alright, and looking at this now, we see that it says nope, I'm sandboxed my World is limited to this file here. I can't see your desktop documents or anything outside that sandbox. It's a security thing and honestly a good one. And going on. If you need me to work with specific files, you'd have to copy them into my workspace. Then I can read edit them or paste the contents of its text into the chat or you're trying to get me to look at it. So there you go. You can see that now with the sandbox it has no access to any of the files in my computer outside of the container. And if I come into the sandbox mode, We see that there are sandboxes because now we have the work sandbox here with all the skills and all of the MD definitions. So if we come into our identity, it should be something like empty right now because we haven't actually added any information. But of course if this is the work account then you'd imagine that it would have some work related characteristics but we just haven't given the agent that information yet. The most important thing to note though is that we do have the sandbox now and the agent does not have any access to our workspace. So I believe that this is a great way to have the security of a VPS without creating one. There are drawbacks, of course, because now we can only access files within the container, which makes this much less useful. And also if you give it access to the internet, it still could do some pretty wacky things So it's definitely a game of pros and cons and weighing the different scenarios, but definitely sandboxing is a great alternative if you don't want to run this on a server So there you have it. That was the course on beginner introduction to open claw. I hope that this was helpful and please leave any comments if you have questions because I will personally be responding to them throughout the week and hoping to address any concerns since this is such a fast evolving project. Thank you for listening.